<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"43015c50db0306033022e077598b9cc8a970363095c49eb65e3b0eeee1fb59d7","plan_job_ref":"Job Pull Request Checks #4506 at https://github.com/GSA-TTS/FAC/actions/runs/14104339416","plan_out_hash":"6bb6fe5332cd6d3e83e219af6f67eb75abe0cb59fa3118c82bfd630d9639c245","plan_hash":"33e865a0a9d0a2613b0cf67a9c1c6ed72e7c3a1b1ef7dda90f668655b765fe20","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 4 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "ce880589-cfed-0c08-7225-d78834d31d26"

-       policy {
-           destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857" -> null
        }
-       policy {
-           destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "e4cb13f2-3e3f-4b19-a1d2-076ebfd1fd7a" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "e4cb13f2-3e3f-4b19-a1d2-076ebfd1fd7a"
        }
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "b03ca21f-c8ff-335b-7ef7-89dd796c8e14"

-       policy {
-           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
        }
-       policy {
-           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
        }
+       policy {
+           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b69d4d374a43cd1d45d015a49e42f391194729e1f716cf98d28b415982225abb" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a73b18094206cac34dc03bbbbfb5892f4b723bb35e6fab14e23381abecd6a1fa"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-21T10:51:41Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-03-21T10:51:33Z" -> (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b69d4d374a43cd1d45d015a49e42f391194729e1f716cf98d28b415982225abb" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a73b18094206cac34dc03bbbbfb5892f4b723bb35e6fab14e23381abecd6a1fa"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-21T10:51:41Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4506](https://github.com/GSA-TTS/FAC/actions/runs/14104339416)